CSI API ETABS v1
eMatType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eMatType
Public Enumeration eMatType
Dim instance As eMatType
public enum class eMatType
type eMatType
Members
Member name | Value | Description
Steel | 1
Concrete | 2
NoDesign | 3
Aluminum | 4
ColdFormed | 5
Rebar | 6
Tendon | 7
Masonry | 8
See Also
Reference
ETABSv1 Namespace